---
kind: property
id: P:Autodesk.Revit.Exceptions.FunctionId.Line
zh: 线、直线
source: html/49c153ad-c2db-913e-d3c4-edafdbe207e7.htm
---
# Autodesk.Revit.Exceptions.FunctionId.Line Property

**中文**: 线、直线

The line number of the function throwing an exception.

## Syntax (C#)
```csharp
public int Line { get; }
```